---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Stairs.IsInEditMode
zh: 楼梯
source: html/06d379fb-9d56-e9a1-909d-152194599997.htm
---
# Autodesk.Revit.DB.Architecture.Stairs.IsInEditMode Method

**中文**: 楼梯

Indicates whether the stairs is in edit mode or not.

## Syntax (C#)
```csharp
public bool IsInEditMode()
```